microbuilder/LPC1114CodeBase/projectconfig.h
/**************************************************************************/
/*! 
    @file     projectconfig.h
    @author   K. Townsend (microBuilder.eu)

    @section LICENSE

    Software License Agreement (BSD License)

    Copyright (c) 2010, microBuilder SARL
    All rights reserved.

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
    1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holders nor the
    names of its contributors may be used to endorse or promote products
    derived from this software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ''AS IS'' AND ANY
    EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
    DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
/**************************************************************************/

#ifndef _PROJECTCONFIG_H_
#define _PROJECTCONFIG_H_

#include "lpc111x.h"
#include "sysdefs.h"

/*=========================================================================
    BOARD SELECTION

    Because several boards use this code library with sometimes slightly
    different pin configuration, you will need to specify which board you
    are using by enabling one of the following definitions. The code base
    will then try to configure itself accordingly for that board.
    -----------------------------------------------------------------------*/
    #define CFG_BRD_LPC1114_REFDESIGN
    // #define CFG_BRD_LPC1114_802154WIRELESS
/*=========================================================================*/


/**************************************************************************

    This table tries to give an indication of which GPIO pins and 
    peripherals are used by the available drivers and SW examples.  Only
    dedicated GPIO pins available on the LPC1114 Reference Board are shown
    below.  Any unused peripheral blocks like I2C, SSP, ADC, etc., can
    also be used as GPIO if they are available.

                PORT 0    PORT 1    PORT 2               PORT 3
                =======   ======    =================    ======
                3 11      2 8 9     4 5 6 7 8 9 10 11    1 2 3

    SDCARD      . .       . . .     X X . . . . .  .     . . .
    PWM         . .       . . X     . . . . . . .  .     . . .
    STEPPER     . .       . . .     . . . . X X X  X     . . .
    CHIBI       . .       . . .     . . . . . . .  .     X X X
    ST7565      . .       . . .     X X X X X X .  .     . . .
    SSD1306 SPI . .       . . .     X X X . X X .  .     . . .
    SSD1306 I2C . .       . . .     . X . . . . .  .     . . .
    INTERFACE   . .       . . .     . . . . . . .  .     . . .
    BATTERY     . X       . . .     . . . . . . .  X     . . .
    VREG [1]    . .       . . .     . . . . . . X  .     . . .
    PN532 [3]   . .       . . .     . . . . . . .  .     X X .

                TIMERS                      SSP       ADC [0]       UART
                ======================      ===       ===========   ====
                16B0  16B1  32B0  32B1      0 1       0 1 2 3 6 7   0

    SDCARD      .     .     .     .         . X       . . . . . .   .
    PWM         .     X     .     .         . .       . . . . . .   .
    PMU [2]     .     .     X     .         . .       . . . . . .   .
    STEPPER     X     .     .     .         . .       . . . . . .   .
    CHIBI       x     .     .     .         X .       . . . . . .   .
    ST7565      .     .     .     .         . .       . . . . . .   .
    SSD1306     .     .     .     .         . .       . . . . . .   .
    INTERFACE   .     .     .     .         . .       . . . . . .   x
    BATTERY     .     .     .     .         . .       X . . . . .   .

    [0]  Not all ADC pins are available on all boards:
         LPC1114 Reference Design:          AD0, AD1, AD6, AD7
         LPC1114 802.15.4 Wireless Board:   AD0, AD1, AD2, AD3
    [1]  Only relevant of the TPS780 is used.  The GPIO pin is used to
         switch from 3.3V to 2.2V depending on the MCUs operating mode.
    [2]  PMU uses 32-bit Timer 0 for SW wakeup from deep-sleep.  This timer
         can safely be used by other peripherals, but may need to be
         reconfigured when you wakeup from deep-sleep.
    [3]  P3.2 only used with the I2C bus (for IRQ)

 **************************************************************************/


/**************************************************************************
    I2C Addresses
    -----------------------------------------------------------------------
    The following addresses are used by the different I2C sensors included
    in the code base [1]

                                HEX       BINARY
                                ====      ========
    LM75B                       0x90      1001000x
    MCP24AA                     0xA0      1010000x
    TSL2561                     0x72      0111001x
    TCS3414                     0x72      0111001x
    PN532                       0x48      0100100x
    SSD1306_I2C                 0x78      0111100x  // Assumes SA0 = GND

