microbuilder/LPC1114CodeBase/projectconfig.h
    [1]  Alternative addresses may exists, but the addresses listed in this
         table are the values used in the code base

 **************************************************************************/


/*=========================================================================
    FIRMWARE VERSION SETTINGS
    -----------------------------------------------------------------------*/
    #define CFG_FIRMWARE_VERSION_MAJOR            (0)
    #define CFG_FIRMWARE_VERSION_MINOR            (8)
    #define CFG_FIRMWARE_VERSION_REVISION         (0)
/*=========================================================================*/


/*=========================================================================
    CORE CPU SETTINGS
    -----------------------------------------------------------------------

    CFG_CPU_CCLK    Value is for reference only.  'core/cpu/cpu.c' must
                    be modified to change the clock speed, but the value
                    should be indicated here since CFG_CPU_CCLK is used by
                    other peripherals to determine timing.

    Note:           At 36MHz 1 tick = ~27.777ns or 0.02777us
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_CPU_CCLK              (36000000)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_CPU_CCLK              (36000000)
    #endif
/*=========================================================================*/


/*=========================================================================
    Power Management (PMU Settings)
    -----------------------------------------------------------------------

    CFG_PMU_USEPOWERPROFILES    If set to 1 LPC1100L power profiles will
                                be used, otherwise they will be ignored.
                                This should only be set for L-series chips.
    CFG_PMU_POWERPROFILE        The default power profile to use for normal
                                program execution.  This can be any of the
                                following value from core/pmu/pmu.h:

                                  pmuPowerProfile_Default
                                  pmuPowerProfile_Performance
                                  pmuPowerProfile_Efficiency
                                  pmuPowerProfile_LowCurrent

    Note: There is an internal check in the pmu code to make sure that the
    chip actually supports power profiles, so these can be safely enabled
    on non L series MCUs.
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_PMU_USEPOWERPROFILES  (1)
      #define CFG_PMU_POWERPROFILE      (pmuPowerProfile_Efficiency)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_PMU_USEPOWERPROFILES  (1)
      #define CFG_PMU_POWERPROFILE      (pmuPowerProfile_LowCurrent)
    #endif
/*=========================================================================*/


/*=========================================================================
    VOLTAGE REGULATOR
    -----------------------------------------------------------------------

    CFG_VREG_VCC_MAIN     Output voltage of the regulator in millivolts
    CFG_VREG_ALT_PRESENT  0 if no alternative voltage is available, 1
                          if it is available (TPS780, etc.)
    CFG_VREG_ALT_VCC      Alternate output voltage in millivolts on the
                          vreg in sleep or low-power mode.  (Only relevant
                          for dual-output regulators like the TPS780, etc.)
    CFG_VREG_ALT_PORT     GPIO port to enable alternate VREG output
    CFG_VREG_ALT_PIN      GPIO pin to enable alternate VREG output
    CFG_VREG_ALT_REG32    IOCON Register for the alt. output enable pin

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_VREG_VCC_MAIN         (3300)    // 3.3V * 1000
      #define CFG_VREG_ALT_PRESENT      (0)
      #define CFG_VREG_ALT_PRESENT      (0)
      #define CFG_VREG_ALT_VCC          (3300)
      #define CFG_VREG_ALT_PORT         (2)
      #define CFG_VREG_ALT_PIN          (10)
      #define CFG_VREG_ALT_REG32        (IOCON_PIO2_10)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_VREG_VCC_MAIN         (3300)    // 3.3V * 1000
      #define CFG_VREG_ALT_PRESENT      (1)
      #define CFG_VREG_ALT_VCC          (2200)    // TPS780 = 3.3V + 2.2V
      #define CFG_VREG_ALT_PORT         (2)
      #define CFG_VREG_ALT_PIN          (10)
      #define CFG_VREG_ALT_REG32        (IOCON_PIO2_10)
    #endif
/*=========================================================================*/


/*=========================================================================
    BATTERY
    -----------------------------------------------------------------------

    CFG_BAT                   If this field is defined it indicates
                              that a user selectable voltage divider is
                              connected to the batter/power supply
    CFG_BAT_ENPORT            The port to enable to battery voltage divider
    CFG_BAT_ENPIN             The pin to enable the battery voltage divider
    CFG_BAT_ADC               The adc port where that the battery is connected
    CFG_BAT_SUPPLYVOLTAGE     The regulated supply voltage in millivolts
    CFG_BAT_MULTIPLIER        Multiplier to convert the adc result to
                              battery voltage - ((R1 + R2) / R2) * 1000

    Note:                     For an example of using this information to
                              determine the battery/power-supply voltage
                              level see 'projects/commands/cmd_sysinfo.c'

                              These settings are not relevant to all boards!
                              'tools/schematics/AT86RF212LPC1114_v1.6.pdf'
                              show how 'BAT' is meant to be connected/used
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define CFG_BAT
      #define CFG_BAT_ENPORT              (2)
      #define CFG_BAT_ENPIN               (11)
      #define CFG_BAT_ENREG32             (IOCON_PIO2_11)
      #define CFG_BAT_ADC                 (0)
      #define CFG_BAT_MULTIPLIER          (0)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_BAT
      #define CFG_BAT_ENPORT              (2)
      #define CFG_BAT_ENPIN               (11)
      #define CFG_BAT_ENREG32             (IOCON_PIO2_11)
      #define CFG_BAT_ADC                 (0)     // AD0 = P0.11
      #define CFG_BAT_MULTIPLIER          (3127)  // ((10.0 + 4.7) / 4.7) * 1000
    #endif
/*=========================================================================*/


/*=========================================================================
    SYSTICK TIMER
    -----------------------------------------------------------------------

