microbuilder/LPC1114CodeBase/projectconfig.h
    CFG_SYSTICK_DELAY_IN_MS   The number of milliseconds between each tick
                              of the systick timer.
							  
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_SYSTICK_DELAY_IN_MS     (1)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_SYSTICK_DELAY_IN_MS     (1)
    #endif
/*=========================================================================*/


/*=========================================================================
    GPIO INTERRUPTS
    -----------------------------------------------------------------------

    IF you wish to use the GPIO interrupt handlers elsewhere in your code,
    you should probably define a seperate IRQHandler for the appropriate
    GPIO bank rather than using the definitions in core/gpio/gpio.c (to
    avoid causing problems in other projects, and to make updates easier,
    etc.)  To disable the default IRQHandler, simply comment out the
    define below for the appropriate GPIO bank and implement the handler
    somewhere else.

    GPIO_ENABLE_IRQ0    If defined, PIOINT0_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ1    If defined, PIOINT1_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ2    If defined, PIOINT2_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ3    If defined, PIOINT3_IRQHandler will be declared and
                        handled in core/gpio/gpio.c

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define GPIO_ENABLE_IRQ0
      // #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      // #define GPIO_ENABLE_IRQ0
      // #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      #define GPIO_ENABLE_IRQ3		// Used for AT86RF212 IRQ
    #endif
/*=========================================================================*/


/*=========================================================================
    UART
    -----------------------------------------------------------------------

    CFG_UART_BAUDRATE         The default UART speed.  This value is used 
                              when initialising UART, and should be a 
                              standard value like 57600, 9600, etc.
    CFG_UART_BUFSIZE          The length in bytes of the UART RX FIFO. This
                              will determine the maximum number of received
                              characters to store in memory.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (128)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (128)
    #endif
/*=========================================================================*/


/*=========================================================================
    ADC
    -----------------------------------------------------------------------

    ADC_AVERAGING_ENABLE      To get better results, the ADC code can take
                              a number of samples and return the average
                              value.  This is slower, but can give more
                              accurate results compared to single-reading.
                              
                              To enable averaging, set ADC_AVERAGING_ENABLE
                              to a non-zero value.
    ADC_AVERAGING_SAMPLES     The number of ADC samples to read and
                              average if ADC averaging is enabled.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define ADC_AVERAGING_ENABLE    (1)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define ADC_AVERAGING_ENABLE    (0)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif
/*=========================================================================*/


/*=========================================================================
    ON-BOARD LED
    -----------------------------------------------------------------------

    CFG_LED_PORT              The port for the on board LED
    CFG_LED_PIN               The pin for the on board LED
    CFG_LED_ON                The pin state to turn the LED on (0 = low, 1 = high)
    CFG_LED_OFF               The pin state to turn the LED off (0 = low, 1 = high)

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_LED_PORT                (3)
      #define CFG_LED_PIN                 (5)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_LED_PORT                (3)
      #define CFG_LED_PIN                 (5)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif
/*=========================================================================*/


/*=========================================================================
    MICRO-SD CARD
    -----------------------------------------------------------------------

    CFG_SDCARD                If this field is defined SD Card and Fat32
                              file system support will be included
    CFG_SDCARD_READONLY       If this is set to 1, all commands to
                              write to the SD card will be removed
                              saving some flash space (-Os).
    CFG_SDCARD_CDPORT         The card detect port number
    CFG_SDCARD_CDPIN          The card detect pin number
    CFG_SDCARD_CDREG32        IOCON Register for the CD pin
    CFG_SDCARD_ENPORT         The power enable port number
    CFG_SDCARD_ENPIN          The power enable pin number
    CFG_SDCARD_ENREG32        IOCON Register for the EN pin

    DEPENDENCIES:             SDCARD requires the use of SSP1.

    Note:                     These settings are not relevant to all boards!
                              'tools/schematics/AT86RF212LPC1114_v1.6.pdf'
                              show how SDCARD is meant to be connected/used
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define CFG_SDCARD
      #define CFG_SDCARD_READONLY         (0)
      #define CFG_SDCARD_CDPORT           (2)
      #define CFG_SDCARD_CDPIN            (4)
      #define CFG_SDCARD_CDREG32          (IOCON_PIO2_4)
      #define CFG_SDCARD_ENPORT           (2)
      #define CFG_SDCARD_ENPIN            (5)
      #define CFG_SDCARD_ENREG32          (IOCON_PIO2_5)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_SDCARD
      #define CFG_SDCARD_READONLY         (0)   // Must be 0 or 1
      #define CFG_SDCARD_CDPORT           (2)
      #define CFG_SDCARD_CDPIN            (4)
      #define CFG_SDCARD_CDREG32          (IOCON_PIO2_4)
      #define CFG_SDCARD_ENPORT           (2)
      #define CFG_SDCARD_ENPIN            (5)
      #define CFG_SDCARD_ENREG32          (IOCON_PIO2_5)
    #endif
/*=========================================================================*/


/*=========================================================================
    PRINTF REDIRECTION
    -----------------------------------------------------------------------

    CFG_PRINTF_UART           Will cause all printf statements to be 
                              redirected to UART
    CFG_PRINTF_NEWLINE        This should be either "\r\n" for Windows or
                              "\n" for *nix

    Note: If no printf redirection definitions are present, all printf
    output will be ignored, though this will also save ~350 bytes flash.

    NOTE: PRINTF Support =    ~350 bytes Flash (-Os)
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_PRINTF_UART
      #define CFG_PRINTF_NEWLINE          "\r\n"
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_PRINTF_UART
      #define CFG_PRINTF_NEWLINE          "\r\n"
    #endif
/*=========================================================================*/


/*=========================================================================
    COMMAND LINE INTERFACE
    -----------------------------------------------------------------------

    CFG_INTERFACE             If this field is defined the UART or USBCDC
                              based command-line interface will be included
    CFG_INTERFACE_MAXMSGSIZE  The maximum number of bytes to accept for an
                              incoming command
    CFG_INTERFACE_PROMPT      The command prompt to display at the start
                              of every new data entry line

    NOTE:                     The command-line interface will use either
                              USB-CDC or UART depending on whether
                              CFG_PRINTF_UART or CFG_PRINTF_USBCDC are 
                              selected.
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "LPC1114 >> "
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "LPC1114 >> "
    #endif
/*=========================================================================*/


/*=========================================================================
    PWM SETTINGS
    -----------------------------------------------------------------------

    CFG_PWM                     If this is defined, a basic PWM driver
                                will be included using 16-bit Timer 1 and
                                Pin 1.9 (MAT0) for the PWM output.  In
                                order to allow for a fixed number of
                                pulses to be generated, some PWM-specific
                                code is required in the 16-Bit Timer 1
                                ISR.  See "core/timer16/timer16.c" for
                                more information.
    CFG_PWM_DEFAULT_PULSEWIDTH  The default pulse width in ticks
    CFG_PWM_DEFAULT_DUTYCYCLE   The default duty cycle in percent

    DEPENDENCIES:               PWM output requires the use of 16-bit
                                timer 1 and pin 1.9 (CT16B1_MAT0).
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define CFG_PWM
      #define CFG_PWM_DEFAULT_PULSEWIDTH  (CFG_CPU_CCLK / 1000)
      #define CFG_PWM_DEFAULT_DUTYCYCLE   (50)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      // #define CFG_PWM
      #define CFG_PWM_DEFAULT_PULSEWIDTH  (CFG_CPU_CCLK / 1000)
      #define CFG_PWM_DEFAULT_DUTYCYCLE   (50)
    #endif
/*=========================================================================*/


/*=========================================================================
    STEPPER MOTOR SETTINGS
    -----------------------------------------------------------------------

    CFG_STEPPER                 If this is defined, a simple bi-polar 
                                stepper motor will be included for common
                                H-bridge chips like the L293D or SN754410N

