microbuilder/LPC1114CodeBase/projectconfig.h
    Note:                     LPC1114 @ 36MHz and the ST7565 with the
                              backlight enabled consumes ~35mA

    DEPENDENCIES:             ST7565 requires the use of pins 2.4-9.
    DEPENDENCIES:             SSD1306 requires the use of pins 2.4-9.
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define CFG_ST7565
      // #define CFG_SSD1306
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      // #define CFG_ST7565
      // #define CFG_SSD1306
    #endif
/*=========================================================================*/


/*=========================================================================
    RSA Encryption
    -----------------------------------------------------------------------

    CFG_RSA                     If defined, support for basic RSA
                                encryption will be included.
    CFG_RSA_BITS                Indicates the number of bits used for
                                RSA encryption keys.  To keep code size
                                reasonable, RSA encryption is currently
                                limited to using 64-bit or 32-bit numbers,
                                with 64-bit providing higher security, and
                                32-bit providing smaller encrypted text
                                size.  Please note that Printf can not be
                                used to display 64-bit values (%lld)!
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1114_REFDESIGN
      // #define CFG_RSA
      #define CFG_RSA_BITS                  (32)
    #endif

    #ifdef CFG_BRD_LPC1114_802154WIRELESS
      // #define CFG_RSA
      #define CFG_RSA_BITS                  (32)
    #endif
/*=========================================================================*/



/*=========================================================================
  CONFIG FILE VALIDATION
  -------------------------------------------------------------------------
  Basic error checking to make sure that incompatible defines are not 
  enabled at the same time, etc.

  =========================================================================*/

#if !defined CFG_BRD_LPC1114_REFDESIGN && !defined CFG_BRD_LPC1114_802154WIRELESS
  #error "You must defined a target board (CFG_BRD_LPC1114_REFDESIGN or CFG_BRD_LPC1114_802154WIRELESS)"
#endif

#if defined CFG_BRD_LPC1114_REFDESIGN && defined CFG_BRD_LPC1114_802154WIRELESS
  #error "Only one target board can be defined at a time (CFG_BRD_LPC1114_REFDESIGN or CFG_BRD_LPC1114_802154WIRELESS)"
#endif

#ifdef CFG_INTERFACE
  #ifndef CFG_PRINTF_UART
    #error "CFG_INTERFACE can not be used without CFG_PRINTF_UART"
  #endif
#endif

#ifdef CFG_CHIBI
  #if !defined CFG_I2CEEPROM
    #error "CFG_CHIBI requires CFG_I2CEEPROM to store and retrieve addresses"
  #endif
  #ifdef CFG_STEPPER
    #error "CFG_CHIBI and CFG_STEPPER can not be defined at the same time since they both use CT16B0"
  #endif
  #if CFG_CHIBI_PROMISCUOUS != 0 && CFG_CHIBI_PROMISCUOUS != 1
    #error "CFG_CHIBI_PROMISCUOUS must be equal to either 1 or 0"
  #endif
#endif

#ifdef CFG_ST7565
  #ifdef CFG_STEPPER
    #error "CFG_ST7565 and CFG_STEPPER can not be defined at the same time since they both use pins 2.8 and 2.9"
  #endif
  #ifdef CFG_SSD1306
    #error "CFG_ST7565 and CFG_SSD1306 can not be defined at the same time"
  #endif
#endif

#ifdef CFG_RSA
  #if CFG_RSA_BITS != 64 && CFG_RSA_BITS != 32
    #error "CFG_RSA_BITS must be equal to either 32 or 64."
  #endif
#endif

#if CFG_VREG_ALT_PRESENT != 1 && CFG_VREG_ALT_PRESENT != 0
  #error "CFG_VREG_ALT_PRESENT must be equal to either 1 or 0"
#endif

#if ADC_AVERAGING_ENABLE && ADC_AVERAGING_SAMPLES < 1
  #error "ADC_AVERAGING_SAMPLES must be 1 or higher when ADC averaging is enabled"
#endif

#endif


